tap 'homebrew/cask-fonts'
tap 'joshmedeski/sesh'

brew 'antidote'
brew 'bat'
brew 'direnv'
brew 'gnupg'
brew 'gopass'
brew 'joshmedeski/sesh/sesh'
brew 'koekeishiya/formulae/skhd'
brew 'pinentry-mac'
brew 'slides'
brew 'starship'
brew 'stow'
brew 'tldr'
brew 'tmux'
brew 'watch'
brew 'zoxide'

# Neovim related
brew 'fd'
brew 'fzf'
brew 'neovim'
brew 'ripgrep'

# Develop tools
brew 'gh'
brew 'git'
brew 'jq'
brew 'lazygit'
brew 'node'
brew 'poetry'
brew 'python@3.13'
brew 'yq'

# Apps
cask '1password-cli'
cask 'arc'
cask 'discord'
cask 'kitty'
cask 'obsidian'
cask 'raycast'
cask 'whisky'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-monaspace'
cask 'font-symbols-only-nerd-font'
