tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'bat'
brew 'gnupg'
brew 'gopass'
brew 'joshsmedeski/sesh/sesh'
brew 'openssl'
brew 'pinentry-mac'
brew 'slides'
brew 'starship'
brew 'tlrc'
brew 'tmux'
brew 'watch'
brew 'zoxide'

# Yubikey related
brew 'hopenpgp-tools'
brew 'ykman'
brew 'yubikey-personalization'

# Neovim related
brew 'fd'
brew 'fzf'
brew 'neovim'
brew 'ripgrep'

# Develop tools
brew 'gh'
brew 'git'
brew 'jq'
brew 'yq'
brew 'lazydocker'
brew 'lazygit'
brew 'node'
brew 'python@3.12'

# Apps
cask '1password-cli'
cask 'arc'
cask 'wezterm'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-monaspace'
cask 'font-symbols-only-nerd-font'
