# For fonts
tap 'homebrew/cask-fonts'
# session manager for tmux
tap 'joshmedeski/sesh'
# Hashicorp tools
tap 'hashicorp/tap'
# Git UI
tap "jesseduffield/lazygit"

# Plugin manager for zsh
brew 'antidote'
# A better cat command
brew 'bat'
# manage your environments by directory/projects
brew 'direnv'
# Modern, maintained replacement for ls
brew 'eza'
# a better find
brew 'fd'
# Command-line fuzzy finder written in Go
brew 'fzf'
# Open Source PGP alternative
brew 'gnupg'
# Password Store with GPG
brew 'gopass'
# Tool for glamorous shell scripts
brew 'gum'
# SQL IDE for your terminal
brew 'harlequin'
# A sesion manager for tmux
brew 'joshmedeski/sesh/sesh' 
# Pin entery for mac
brew 'pinentry-mac'
# find files fast
brew 'ripgrep'
# presentation via (neo)vim
brew 'slides'
# your favourite customize prompt
brew 'starship'
# manage your dotfiles
brew 'stow'
 # do not bother to find on the Internet
brew 'tldr'
 # the one and only terminal multiplexer
brew 'tmux'
 # watch your commands
brew 'watch'
 # cd on steriods
brew 'zoxide'

# Editor stuff
# the one and only editor
brew 'neovim'

# Develop tools
# Cross-platform make
brew "cmake"
# Github CLI tools
brew 'gh'
# Git
brew 'git'
# Gitlab CLI tools
brew 'glab'
# JQuery on CLI
brew 'jq'
# Git TUI
brew "jesseduffield/lazygit/lazygit"
# Build network applications with javascript
brew 'node'
# Open Source alternative for Terraform
brew 'opentofu'
# Application and package manager for Python
brew 'poetry'
# Programming language
brew 'python@3.13'
# Powerful, clean, object-oriented scripting language
brew 'ruby'
# YAML on CLI, a jq alternative for YAML
brew 'yq'

# Hashistuff
brew 'hashicorp/tap/consul'
brew 'hashicorp/tap/nomad'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'

# Apps
cask '1password-cli'
cask 'arc'
cask 'ghostty'
cask 'obsidian'
cask 'raycast'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-monaspace'
cask 'font-symbols-only-nerd-font'

# vim: ft=conf
