tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'federico-terzi/espanso'
tap 'hashicorp/tap'

brew 'zsh'
brew 'neovim'
brew 'gnupg'
brew 'gopass'
brew 'pinentry-mac'
brew 'composer'
brew 'watch'
brew 'node'
brew 'tmux'
brew 'python3'
brew 'pyenv'
brew 'php'
brew 'yubikey-personalization'
brew 'hopenpgp-tools'
brew 'ykman'
brew 'espanso'
brew 'gitmoji'
brew 'the_silver_searcher'
brew 'kubectl'
brew 'helm'
brew 'fzf'
brew 'golang'

# Hashistack
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
brew 'hashicorp/tap/consul'
brew 'hashicorp/tap/nomad'
brew 'hashicorp/tap/wavepoint'
brew 'hashicorp/tap/boundary'
brew 'hashicorp/tap/terraform-ls'
brew 'consul-template'
brew 'terraform-provisioner-ansible'

# Apps
cask 'visual-studio-code'
cask 'firefox'
cask 'iterm2'
cask 'brave-browser'

# Fonts
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-powerline-symbols'
