tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'federico-terzi/espanso'
tap 'hashicorp/tap'

brew 'gnupg'
brew 'gopass'
brew 'pinentry-mac'
brew 'watch'
brew 'tmux'
brew 'yubikey-personalization'
brew 'hopenpgp-tools'
brew 'ykman'
brew 'coreutils'
brew 'openssl'

# Neovim related
brew 'neovim'
brew 'fzf'
brew 'the_silver_searcher'
brew 'tree-sitter'
brew 'solargraph'
brew 'prettier'
brew 'shfmt'
brew 'markdownlint-cli'
brew 'shellcheck'
brew 'flake8'
brew 'black'

# Develop tools
brew 'jq'
brew 'composer'
brew 'node@16'
brew 'python3'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'php'
brew 'git'
brew 'gitmoji'

# Hashistack
brew 'hashicorp/tap/terraform-ls'
brew 'hashicorp/tap/boundary'

# Apps
cask 'firefox'
cask 'iterm2'
cask 'brave-browser'
cask '1password'
cask '1password-cli'
cask 'vmware-fusion'
cask 'fig'
cask 'dash'
cask 'balenaetcher'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-powerline-symbols'
