tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'federico-terzi/espanso'
tap 'hashicorp/tap'

brew 'gnupg'
brew 'gopass'
brew 'pinentry-mac'
brew 'watch'
brew 'tmux'
brew 'yubikey-personalization'
brew 'hopenpgp-tools'
brew 'ykman'
brew 'coreutils'
brew 'openssl'

# Neovim related
brew 'neovim'
brew 'fzf'
brew 'solargraph'

# Develop tools
brew 'aquaproj/aqua/aqua'
brew 'jq'
brew 'node@16'
brew 'python3'
brew 'miniconda'
brew 'git'
brew 'gh'
brew 'prettier'
brew 'shfmt'
brew 'markdownlint-cli'
brew 'shellcheck'
brew 'flake8'
brew 'black'

# Hashistack
brew 'hashicorp/tap/terraform-ls'
brew 'hashicorp/tap/boundary'

# Apps
cask 'kitty'
cask '1password-cli'
cask 'vmware-fusion'
cask 'firefox'
cask 'google-chrome'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-symbols-only-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-powerline-symbols'
